{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import bs4\n",
    "from bs4 import BeautifulSoup as soup\n",
    "from urllib.request import Request, urlopen\n",
    "from termcolor import colored\n",
    "#pip install termcolor"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "#CLASE PAR CREAR NODO CENTRAR-PARQUE CENTRAL\n",
    "class CLASE_NEO4J(object): \n",
    "    def __init__(self):\n",
    "        self._driver = GraphDatabase.driver(\"bolt:neo4j://localhost:7687\", auth=(\"neo4j\", \"neo4jj\"), encrypted=False)\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "    def CREAR_LUGAR(self, message,lugar,latitud,longitud):\n",
    "        with self._driver.session() as session:\n",
    "            greeting = session.write_transaction(self._VALIDAR_LUGAR, message,lugar,latitud,longitud)\n",
    "            print(greeting)\n",
    "    def CREAR_RUTA(self,origen,destino,costo,hn):\n",
    "        with self._driver.session() as session:\n",
    "            greeting2 = session.write_transaction(self._VALIDAR_RUTA,origen,destino,costo,hn)\n",
    "            print(greeting2) \n",
    "    def CREAR_LUGAR_KNN(self, message,lugar,latitud,longitud,estrellas,infectados,tipo):\n",
    "        with self._driver.session() as session:\n",
    "            greeting = session.write_transaction(self._VALIDAR_LUGAR_KNN, message,lugar,latitud,longitud,estrellas,infectados,tipo)\n",
    "            print(greeting)\n",
    "    \n",
    "    #METODO PARA CREAR LOS NODOS DE LUGARES PARA ALGORITMO COSTO\n",
    "    @staticmethod\n",
    "    def _VALIDAR_LUGAR(tx, message,lugar,latitud,longitud):\n",
    "        #SE BUSCA SI EL LUGAR DEL ARREGLO EXISTE EN LA BASE NEO4J\n",
    "        result2 = tx.run(\"match(l:Lugares {nombre:'\"+lugar+\"',latitud:\"+latitud+\",longitud:\"+longitud+\"}) return l.nombre\").data()\n",
    "        #CONDICION PARA VERIFICAR SI EXISTE\n",
    "        if int(len(result2)) == 0:\n",
    "            print(\"SE CREA EL LUGAR EN LA BASE..........\")\n",
    "            #SE CREA NODO LUGAR\n",
    "            result = tx.run(\"CREATE(\"+lugar+\":Lugares {nombre:'\"+lugar+\"',latitud:\"+latitud+\",longitud:\"+longitud+\"}) \"\n",
    "                        \"SET \"+lugar+\".message = $message \"\n",
    "                        \"RETURN \"+lugar+\".message + ', from node ' + id(\"+lugar+\")\", message=message)\n",
    "        elif int(len(result2))  == 1:\n",
    "            print(\"EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\")\n",
    "    \n",
    "    #METODO PARA CREAR LOS NODOS DE LUGARES PARA EL ALGORITMO KNN\n",
    "    @staticmethod\n",
    "    def _VALIDAR_LUGAR_KNN(tx, message,lugar,latitud,longitud,estrellas,infectados,tipo):\n",
    "        #SE BUSCA SI EL LUGAR DEL ARREGLO EXISTE EN LA BASE N,estrellas,infectadosEO4J\n",
    "        result2 = tx.run(\"match(l:\"+tipo+\" {nombre:'\"+lugar+\"',latitud:\"+latitud+\",longitud:\"+longitud+\",estrellas:\"+estrellas+\",infectados:\"+infectados+\"}) return l.nombre\").data()\n",
    "        #CONDICION PARA VERIFICAR SI EXISTE\n",
    "        if int(len(result2)) == 0:\n",
    "            print(\"SE CREA EL LUGAR EN LA BASE..........\")\n",
    "            #SE CREA NODO LUGAR\n",
    "            result = tx.run(\"CREATE(\"+lugar+\":\"+tipo+\" {nombre:'\"+lugar+\"',latitud:\"+latitud+\",longitud:\"+longitud+\",estrellas:\"+estrellas+\",infectados:\"+infectados+\"}) \"\n",
    "                        \"SET \"+lugar+\".message = $message \"\n",
    "                        \"RETURN \"+lugar+\".message + ', from node ' + id(\"+lugar+\")\", message=message)\n",
    "        elif int(len(result2))  == 1:\n",
    "            print(\"EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\")\n",
    "            \n",
    "    #METODO PARA CREAR LAS RELACIONES CON EL COSTE  Y HN PARA LA RUTA\n",
    "    @staticmethod\n",
    "    def _VALIDAR_RUTA(tx,origen,destino,costo,hn):\n",
    "        #SE BUSCA SI LA RUTA A CREAR YA DEL ARREGLO EXISTE EN LA BASE NEO4J\n",
    "        result = tx.run(\"match(l1:Lugares{nombre:'\"+origen+\"'})-[r:RUTA_DE{costo:\"+str(costo)+\",hn:\"+str(hn)+\"}]->(l2:Lugares{nombre:'\"+destino+\"'}) return l2\").data()\n",
    "        if int(len(result)) == 0:\n",
    "            print(\"SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\")\n",
    "            result2 = tx.run(\" match(\"+origen+\":Lugares {nombre:'\"+origen+\"'}) match(\"+destino+\":Lugares {nombre:'\"+destino+\"'}) create(\"+origen+\")-[:RUTA_DE{costo:\"+str(costo)+\",hn:\"+str(hn)+\"}]->(\"+destino+\")\")\n",
    "        elif int(len(result)) == 1:\n",
    "            print(colored(\"YA EXISTE LA RUTA**********\", 'green'))\n",
    "# MATCH (n) OPTIONAL MATCH (n)-[r]-() DELETE n,r\n",
    "#SE INICIALIZA LA CLASE DE LOS METODOS DE NEO4J\n",
    "grafo=CLASE_NEO4J()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "HOTEL_MONTECARLO -79.16885 -9.17885\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "PARQUE_CENTRAL -0.22214 -0.34216\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_CODELL -0.2975 -79.16784\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_PICHINCHA -0.24665 -79.19275\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_CHURRERIA -0.2975 -79.1765\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_QUINTA_DORADA -0.23421 -79.16772\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_CORBAN_COFFEE -0.27227 -79.1402\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_TENTACIONES -0.25516 -79.18057\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_DELIRIO -0.25487 -79.1854\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_IMPERIAL -0.24886 -79.15787\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_ESTACION -0.25307 -79.17365\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_BOM -0.24781 -79.15229\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_PAOLA -0.26004 -79.16534\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_CHILENO -0.2476 -79.15319\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_NELLY -0.24873 -79.15046\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_RIOBAMBA -0.2473 -79.15811\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_ROCIO -0.24528 -79.18359\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_HUASI -0.24936 -79.16421\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_TORIL -0.2478 -79.15211\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_PRIMAVERA -0.24848 -79.15261\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_GABRIEL -0.24528 -79.15811\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_SOL -0.26004 -79.16534\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_INTERNACIONAL -0.24525 -79.16612\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_ACACIAS -0.24986 -79.16322\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_MAYA -0.24525 -79.16612\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_TROJE -0.26004 -79.17629\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_PERUANA -0.2473 -79.15811\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_MOLINO -0.24528 -79.16534\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_SHALOM -0.24525 -79.16322\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_TAURO -0.24759 -79.15341\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_CHACARERO -0.24528 -79.18359\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_JEKE -0.25337 -79.15229\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_XIMENITA -0.24759 -79.19456\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_ROSITA -0.25077 -79.16322\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "HOTEL_DORADO -0.24986 -79.15261\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_SABOR -0.2473 -79.15811\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_BOEMIA -0.26004 -79.15046\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_PILSENER -0.24848 -79.16322\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_ANDESBULL -0.25578 -79.18003\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_QUINCHOS -0.25197 -79.15253\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_NORTENO -0.24936 -79.18003\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_YAGUAR -0.24886 -79.1402\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_BURGER -0.25382 -79.16772\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_LINA -0.24759 -79.13482\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_COFFEREX -0.26618 -79.11198\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "RESTAURANTE_BONNY -0.25337 -79.1681\n",
      "EL NODO LUGAR YA EXISTE, INGRESAR OTRO LUGAR........\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "SE CREA LOS NODOS DE RELACION DE RUTAS ENTRE LOS LUGARES ................\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "\u001b[32mYA EXISTE LA RUTA**********\u001b[0m\n",
      "None\n",
      "RESTAURANTE_CODELL -0.2975 -79.16784\n",
      "SE CREA EL LUGAR EN LA BASE..........\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\n",
      "RESTAURANTE_PICHINCHA -0.24665 -79.19275\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_CHURRERIA -0.2975 -79.1765\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_QUINTA_DORADA -0.23421 -79.16772\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_CORBAN_COFFEE -0.27227 -79.1402\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_TENTACIONES -0.25516 -79.18057\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_DELIRIO -0.25487 -79.1854\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_BOM -0.24781 -79.15229\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_PAOLA -0.26004 -79.16534\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_CHILENO -0.2476 -79.15319\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_NELLY -0.24873 -79.15046\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_TAURO -0.24759 -79.15341\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_SABOR -0.2473 -79.15811\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_BOEMIA -0.26004 -79.15046\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_PILSENER -0.24848 -79.16322\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_ANDESBULL -0.25578 -79.18003\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_QUINCHOS -0.25197 -79.15253\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_NORTENO -0.24936 -79.18003\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_YAGUAR -0.24886 -79.1402\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_BURGER -0.25382 -79.16772\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_LINA -0.24759 -79.13482\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_COFFEREX -0.26618 -79.11198\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_BONNY -0.25337 -79.1681\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_JEKE -0.25337 -79.15229\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_XIMENITA -0.24759 -79.19456\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "RESTAURANTE_ROSITA -0.25077 -79.16322\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_MONTECARLO -79.16885 -9.17885\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "PARQUE_CENTRAL -0.22214 -0.34216\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_IMPERIAL -0.24886 -79.15787\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_ESTACION -0.25307 -79.17365\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_RIOBAMBA -0.2473 -79.15811\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_ROCIO -0.24528 -79.18359\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_HUASI -0.24936 -79.16421\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_TORIL -0.2478 -79.15211\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_PRIMAVERA -0.24848 -79.15261\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_GABRIEL -0.24528 -79.15811\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_SOL -0.26004 -79.16534\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_INTERNACIONAL -0.24525 -79.16612\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_ACACIAS -0.24986 -79.16322\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_MAYA -0.24525 -79.16612\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_TROJE -0.26004 -79.17629\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_PERUANA -0.2473 -79.15811\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_MOLINO -0.24528 -79.16534\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_SHALOM -0.24525 -79.16322\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_CHACARERO -0.24528 -79.18359\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n",
      "HOTEL_DORADO -0.24986 -79.15261\n",
      "SE CREA EL LUGAR EN LA BASE..........\n",
      "None\n"
     ]
    }
   ],
   "source": [
    "#SE CREA LA LISTA DE NODOS LUGARES \n",
    "listaL = ([\"HOTEL_MONTECARLO\",-79.16885,-09.17885,2,10],\n",
    "          [\"PARQUE_CENTRAL\",-0.22214,-0.34216,3,20],\n",
    "          [\"RESTAURANTE_CODELL\",-0.2975,-79.16784,4,11],\n",
    "          [\"RESTAURANTE_PICHINCHA\",-0.24665,-79.19275,1,9],\n",
    "          [\"RESTAURANTE_CHURRERIA\",-0.2975,-79.1765,2,2],\n",
    "          [\"RESTAURANTE_QUINTA_DORADA\",-0.23421,-79.16772,5,23],\n",
    "          [\"RESTAURANTE_CORBAN_COFFEE\",-0.27227,-79.1402,3,15],\n",
    "          [\"RESTAURANTE_TENTACIONES\",-0.25516,-79.18057,2,16],\n",
    "          [\"RESTAURANTE_DELIRIO\",-0.25487,-79.1854,4,20],\n",
    "          [\"HOTEL_IMPERIAL\",-0.24886, -79.15787,3,25],\n",
    "          [\"HOTEL_ESTACION\",-0.25307,-79.17365,1,25],\n",
    "          [\"RESTAURANTE_BOM\",-0.24781,-79.15229,3,14],\n",
    "          [\"RESTAURANTE_PAOLA\",-0.26004,-79.16534,5,19],\n",
    "          [\"RESTAURANTE_CHILENO\",-0.2476,-79.15319,3,23],\n",
    "          [\"RESTAURANTE_NELLY\",-0.24873,-79.15046,2,34],\n",
    "          [\"HOTEL_RIOBAMBA\",-0.2473,-79.15811,4,22],\n",
    "          [\"HOTEL_ROCIO\",-0.24528,-79.18359,1,26],\n",
    "          [\"HOTEL_HUASI\",-0.24936,-79.16421,4,27],\n",
    "          [\"HOTEL_TORIL\",-0.2478,-79.15211,2,15],\n",
    "          [\"HOTEL_PRIMAVERA\",-0.24848,-79.15261,3,6],\n",
    "          [\"HOTEL_GABRIEL\",-0.24528,-79.15811,5,30],\n",
    "          [\"HOTEL_SOL\",-0.26004,-79.16534,4,25],\n",
    "          [\"HOTEL_INTERNACIONAL\",-0.24525,-79.16612,3,25],\n",
    "          [\"HOTEL_ACACIAS\",-0.24986,-79.16322,3,45],\n",
    "          [\"HOTEL_MAYA\",-0.24525,-79.16612,3,21],\n",
    "          [\"HOTEL_TROJE\",-0.26004,-79.17629,2,45],\n",
    "          [\"HOTEL_PERUANA\",-0.2473,-79.15811,1,23],\n",
    "          [\"HOTEL_MOLINO\",-0.24528,-79.16534,5,25],\n",
    "          [\"HOTEL_SHALOM\",-0.24525,-79.16322,2,15],\n",
    "          [\"RESTAURANTE_TAURO\",-0.24759,-79.15341,4,26],\n",
    "          [\"HOTEL_CHACARERO\",-0.24528,-79.18359,3,45],\n",
    "          [\"RESTAURANTE_JEKE\",-0.25337,-79.15229,2,32],\n",
    "          [\"RESTAURANTE_XIMENITA\",-0.24759,-79.19456,1,32],\n",
    "          [\"RESTAURANTE_ROSITA\",-0.25077,-79.16322,3,28],\n",
    "          [\"HOTEL_DORADO\",-0.24986,-79.15261,2,35],\n",
    "          [\"RESTAURANTE_SABOR\",-0.2473,-79.15811,1,32],\n",
    "          [\"RESTAURANTE_BOEMIA\",-0.26004,-79.15046,3,24],\n",
    "          [\"RESTAURANTE_PILSENER\",-0.24848,-79.16322,4,37],\n",
    "          [\"RESTAURANTE_ANDESBULL\",-0.25578,-79.18003,1,45],\n",
    "          [\"RESTAURANTE_QUINCHOS\",-0.25197,-79.15253,2,36],\n",
    "          [\"RESTAURANTE_NORTENO\",-0.24936,-79.18003,3,56],\n",
    "          [\"RESTAURANTE_YAGUAR\",-0.24886,-79.1402,4,23],\n",
    "          [\"RESTAURANTE_BURGER\",-0.25382,-79.16772,5,67],\n",
    "          [\"RESTAURANTE_LINA\",-0.24759,-79.13482,3,43],\n",
    "          [\"RESTAURANTE_COFFEREX\",-0.26618,-79.11198,4,76],\n",
    "          [\"RESTAURANTE_BONNY\",-0.25337,-79.1681,14])\n",
    "for ll in listaL:\n",
    "    #SE INICIA EL METODO DE GENERAR NODOS LUGARES\n",
    "    print(str(ll[0]),str(ll[1]),str(ll[2]))\n",
    "    grafo.CREAR_LUGAR(\"NODO CREADO\",str(ll[0]),str(ll[1]),str(ll[2]))\n",
    "    \n",
    "# SE GENERA LAS RELACIONES DE LOS LUGARES\n",
    "#SE CREA LA LISTA DE LAS RELACIONES Y LOS NODOS\n",
    "listaL = (['PARQUE_CENTRAL','HOTEL_MONTECARLO',0.10371,0.350],\n",
    "          ['PARQUE_CENTRAL','RESTAURANTE_CODELL',0.9416,0.600],\n",
    "          ['RESTAURANTE_CODELL','RESTAURANTE_PICHINCHA',0.11894,0.130],\n",
    "          ['HOTEL_MONTECARLO','RESTAURANTE_CHURRERIA',0.6768,0.9100],          \n",
    "          ['HOTEL_MONTECARLO','RESTAURANTE_QUINTA_DORADA',0.4681,0.3500],          \n",
    "          ['RESTAURANTE_CORBAN_COFFEE','RESTAURANTE_TENTACIONES',0.5173,0.7700],          \n",
    "          ['RESTAURANTE_CORBAN_COFFEE','HOTEL_LIBERTADOR',0.1041,0.1100],\n",
    "          ['RESTAURANTE_CORBAN_COFFEE','RESTAURANTE_DELIRIO',0.10271,0.350],\n",
    "          ['HOTEL_LIBERTADOR','HOTEL_IMPERIAL',0.37,0.350],\n",
    "          ['HOTEL_LIBERTADOR','HOTEL_ESTACION',0.121,0.400],\n",
    "          ['RESTAURANTE_CORBAN_COFFEE','RESTAURANTE_BOM',0.5184,0.350],\n",
    "          ['RESTAURANTE_BOM','RESTAURANTE_PAOLA',0.184,0.190],\n",
    "          ['RESTAURANTE_PICHINCHA','RESTAURANTE_CHILENO',0.131,0.500],\n",
    "          ['RESTAURANTE_PICHINCHA','RESTAURANTE_NELLY', 0.51,0.290],\n",
    "          ['RESTAURANTE_NELLY','RESTAURANTE_DELIRIO', 0.115,0.130],          \n",
    "          ['RESTAURANTE_CHILENO','RESTAURANTE_NELLY', 0.116,0.500],          \n",
    "          ['RESTAURANTE_DELIRIO','HOTEL_DORADO', 0.101,0.140],          \n",
    "          ['RESTAURANTE_DELIRIO','HOTEL_LIBERTADOR', 0.121,0.550],          \n",
    "          ['HOTEL_LIBERTADOR','HOTEL_DORADO', 0.117,0.270],          \n",
    "          ['HOTEL_DORADO','HOTEL_ESTACION', 0.131,0.140],           \n",
    "          ['RESTAURANTE_CHILENO','HOTEL_DORADO', 0.294,0.450],          \n",
    "          ['RESTAURANTE_PAOLA','HOTEL_LIBERTADOR', 0.150,0.250],\n",
    "          ['RESTAURANTE_PAOLA','HOTEL_ESTACION', 0.191,0.450],          \n",
    "          ['HOTEL_RIOBAMBA','RESTAURANTE_CHURRERIA', 0.209,0.650],          \n",
    "          ['RESTAURANTE_RIOBAMBA','RESTAURANTE_PAOLA', 0.5300,0.6400],                \n",
    "          ['RESTAURANTE_QUINTA_DORADA','RESTAURANTE_PAOLA', 0.187,0.400],    \n",
    "          ['RESTAURANTE_CHURRRIA','HOTEL_ESTACION', 0.338,0.400],          \n",
    "          ['RESTAURANTE_CODELL','HOTEL_DORADO', 0.358,0.450],                \n",
    "          ['HOTEL_ESTACION','PARQUE_CENTRAL',0.351,0.450],                \n",
    "          ['RESTAURANTE_NELLY','RESTAURANTE_TENTACIONES', 0.158,0.170],                \n",
    "          ['RESTAURANTE_DELIRIO','RESTAURANTE_PAOLA', 0.263,0.500],          \n",
    "           ['HOTEL_RIOBAMBA','RESTAURANTE_LINA', 0.205,0.500],          \n",
    "           ['RESTAURANTE_LINA','RESTAURANTE_PAOLA', 2.41,3.30],           \n",
    "           ['RESTAURANTE_LINA','RESTAURANTE_BUGER', 2.6,2.5],           \n",
    "           ['RESTAURANTE_CHURRERIA','RESTAURANTE_NORTENO', 1.04,1.9],          \n",
    "           ['RESTAURANTE_NORTENO','RESTAURANTE_LINA',0.189,0.260],           \n",
    "           ['RESTAURANTE_QUINTA_DORADA','RESTAURANTE_NORTENO', 0.189,0.260],          \n",
    "           ['HOTEL_IMPERIAL','RESTAURANTE_TENTACIONES', 0.95,0.400],          \n",
    "           ['RESTAURANTE_CHURRERIA','RESTAURANTE_YAGUAR', 0.699,0.850],          \n",
    "           ['RESTAURANTE_YAGUAR','RESTAURANTE_BONNY', 1.33,2.1],          \n",
    "           ['RESTAURANTE_YAGUAR','RESTAURANTE_BURGER', 1.26,2.0],          \n",
    "           ['RESTAURANTE_PILSENER','RESTAURANTE_YAGUAR', 1.30,1.5],          \n",
    "           ['RESTAURANTE_PILSENER','RESTAURANTE_QUINCHOS', 1.23,2.0], \n",
    "           ['HOTEL_MONTECARLO','RESTAURANTE_PILSENER',0.654,0.800],           \n",
    "          ['RESTAURANTE_BURGER','HOTEL_RIOBAMBA',0.6768,0.9100],\n",
    "          ['HOTEL_MONTECARLO','RESTAURANTE_CHURRERIA',0.6768,0.9100],          \n",
    "          ['RESTAURANTE_BONNY','RESTAURANTE_BURGER',0.6768,0.9100],          \n",
    "          ['RESTAURANTE_BONNY','RESTAURANTE_QUINCHOS',0.6768,0.9100],        \n",
    "          ['HOTEL_IMPERIAL','RESTAURANTE_CHILENO',0.284,0.500],\n",
    "          ['RESTAURANTE_HUASI','HOTEL_IMPERIAL',0.676,0.650],\n",
    "          ['RESTAURANTE_QUINCHOS','RESTAURANTE_BOEMIA',0.6768,0.9100],          \n",
    "          ['RESTAURANTE_BOEMIA','RESTAURANTE_ANDESBULL',0.6768,0.9100],          \n",
    "          ['RESTAURANTE_BOEMIA','RESTAURANTE_XIMENITA',0.6768,0.9100],          \n",
    "          ['RESTAURANTE_SABOR','RESTAURANTE_PILSENER',1.54,2.4],          \n",
    "          ['RESTAURANTE_SABOR','RESTAURANTE_BOEMIA',0.6768,0.9100],       \n",
    "          ['RESTAURANTE_ROSITA','RESTAURANTE_SABOR',2.26,3.0],     \n",
    "          ['HOTEL_CHACARRERO','RESTAURANTE_SABOR',0.65,0.950],          \n",
    "          ['HOTEL_CHACARRERO','RESTAURANTE_XIMENITA',0.688,0.918],          \n",
    "          ['RESTAURANTE_QUINTA_DORADA','HOTEL_CHACARRERO',0.67,0.9100],          \n",
    "          ['RESTAURANTE_XIMENITA','RESTAURANTE_ROSITA',0.67,0.874],          \n",
    "          ['RESTAURANTE_ROSITA','RESTAURANTE_COFFEREX',0.54,0.74],          \n",
    "          ['RESTAURANTE_QUINTA_DORADA','HOTEL_CHACARRERO',0.68,0.470],          \n",
    "          ['HOTEL_ESTACION','RESTAURANTE_PICHINCA',0.57,0.74],          \n",
    "          ['RESTAURANTE_CODELL','HOTEL_RIOBAMBA',0.812,0.74],          \n",
    "          ['HOTEL_RIOBAMBA','HOTEL_PRIVAMERA',0.550,0.7420],          \n",
    "          ['RESTAURANTE_COFFEREX','HOTEL_HUASI',0.57,0.74],          \n",
    "          ['RESTAURANTE_COFFEREX','HOTEL_SOL',0.57,0.74],          \n",
    "          ['HOTEL_SOL','RESTAURANTE_PILSENER',0.57,0.74],          \n",
    "          ['HOTEL_ESTACION','RESTAURANTE_PICHINCA',0.57,0.74],          \n",
    "          ['HOTEL_SOL','HOTEL_ROCIO',0.47,0.78],          \n",
    "          ['HOTEL_SOL','RESTAURANTE_CODELL',0.74,0.65],         \n",
    "          ['RESTAURANTE_ANDESBULL','RESTAURANTE_XIMENITA',0.57,0.74],          \n",
    "          ['HOTEL_ROCIO','RESTAURANTE_CODELL',0.57,0.74],          \n",
    "          ['HOTEL_CHACARRERO','HOTEL_ROCIO',0.57,0.74],          \n",
    "          ['HOTEL_PRIMAVERA','HOTEL_ROCIO',0.57,0.74],          \n",
    "          ['RESTAURANTE_CHILENO','HOTEL_PRIMAVERA',0.57,0.74],          \n",
    "          ['HOTEL_PRIMAVERA','RESTAURANTE_JEKE',0.57,0.74],          \n",
    "          ['HOTEL_HUASI','RESTAURANTE_JEKE',0.57,0.74],          \n",
    "          ['HOTEL_HUASI','RESTAURANTE_CHACARRERO',0.57,0.74],         \n",
    "          ['HOTEL_HUASI','HOTEL_ROCIO','0.57','0.74'],\n",
    "          ['RESTAURANTE_YAGUAR','RESTAURANTE_QUINCHOS',0.25,0.50],          \n",
    "          ['RESTAURANTE_JEKE','HOTEL_IMPERIAL',0.30,0.38] \n",
    "\n",
    "         )\n",
    "\n",
    "#          ['RESTAURANTE_QUINTA_DORADA','RESTAURANTE_CORBAN_COFFEE','0.6079','0.8000'],\n",
    "for ll in listaL:\n",
    "    #SE INICIA EL METODO DE GENERAR NODOS LUGARES\n",
    "    grafo.CREAR_RUTA(str(ll[0]),str(ll[1]),str(ll[2]),str(ll[3]))\n",
    "\n",
    "#-------------------------------NODOS PARA ALGORITMO KNN----------------\n",
    "listar= ([\"RESTAURANTE_CODELL\",-0.2975,-79.16784,4,11],\n",
    "          [\"RESTAURANTE_PICHINCHA\",-0.24665,-79.19275,1,9],\n",
    "          [\"RESTAURANTE_CHURRERIA\",-0.2975,-79.1765,2,2],\n",
    "          [\"RESTAURANTE_QUINTA_DORADA\",-0.23421,-79.16772,5,23],\n",
    "          [\"RESTAURANTE_CORBAN_COFFEE\",-0.27227,-79.1402,3,15],\n",
    "          [\"RESTAURANTE_TENTACIONES\",-0.25516,-79.18057,2,16],\n",
    "          [\"RESTAURANTE_DELIRIO\",-0.25487,-79.1854,4,20],\n",
    "          [\"RESTAURANTE_BOM\",-0.24781,-79.15229,3,14],\n",
    "          [\"RESTAURANTE_PAOLA\",-0.26004,-79.16534,5,19],\n",
    "          [\"RESTAURANTE_CHILENO\",-0.2476,-79.15319,3,23],\n",
    "          [\"RESTAURANTE_NELLY\",-0.24873,-79.15046,2,34],\n",
    "          [\"RESTAURANTE_TAURO\",-0.24759,-79.15341,4,26],\n",
    "          [\"RESTAURANTE_SABOR\",-0.2473,-79.15811,1,32],\n",
    "          [\"RESTAURANTE_BOEMIA\",-0.26004,-79.15046,3,24],\n",
    "          [\"RESTAURANTE_PILSENER\",-0.24848,-79.16322,4,37],\n",
    "          [\"RESTAURANTE_ANDESBULL\",-0.25578,-79.18003,1,45],\n",
    "          [\"RESTAURANTE_QUINCHOS\",-0.25197,-79.15253,2,36],\n",
    "          [\"RESTAURANTE_NORTENO\",-0.24936,-79.18003,3,56],\n",
    "          [\"RESTAURANTE_YAGUAR\",-0.24886,-79.1402,4,23],\n",
    "          [\"RESTAURANTE_BURGER\",-0.25382,-79.16772,5,67],\n",
    "          [\"RESTAURANTE_LINA\",-0.24759,-79.13482,3,43],\n",
    "          [\"RESTAURANTE_COFFEREX\",-0.26618,-79.11198,4,76],\n",
    "          [\"RESTAURANTE_BONNY\",-0.25337,-79.1681,1,14],\n",
    "          [\"RESTAURANTE_JEKE\",-0.25337,-79.15229,2,32],\n",
    "          [\"RESTAURANTE_XIMENITA\",-0.24759,-79.19456,1,32],\n",
    "          [\"RESTAURANTE_ROSITA\",-0.25077,-79.16322,3,28])\n",
    "st =\"Restaurantes\"\n",
    "for ll in listar:\n",
    "    #SE INICIA EL METODO DE GENERAR NODOS LUGARES\n",
    "    print(str(ll[0]),str(ll[1]),str(ll[2]))\n",
    "    grafo.CREAR_LUGAR_KNN(\"NODO CREADO\",str(ll[0]),str(ll[1]),str(ll[2]),str(ll[3]),str(ll[4]),st)\n",
    "#SE CREA LA LISTA DE NODOS LUGARES \n",
    "listaL = ([\"HOTEL_MONTECARLO\",-79.16885,-09.17885,2,10],\n",
    "          [\"PARQUE_CENTRAL\",-0.22214,-0.34216,3,20],\n",
    "          [\"HOTEL_IMPERIAL\",-0.24886, -79.15787,3,25],\n",
    "          [\"HOTEL_ESTACION\",-0.25307,-79.17365,1,25],\n",
    "          [\"HOTEL_RIOBAMBA\",-0.2473,-79.15811,4,22],\n",
    "          [\"HOTEL_ROCIO\",-0.24528,-79.18359,1,26],\n",
    "          [\"HOTEL_HUASI\",-0.24936,-79.16421,4,27],\n",
    "          [\"HOTEL_TORIL\",-0.2478,-79.15211,2,15],\n",
    "          [\"HOTEL_PRIMAVERA\",-0.24848,-79.15261,3,6],\n",
    "          [\"HOTEL_GABRIEL\",-0.24528,-79.15811,5,30],\n",
    "          [\"HOTEL_SOL\",-0.26004,-79.16534,4,25],\n",
    "          [\"HOTEL_INTERNACIONAL\",-0.24525,-79.16612,3,25],\n",
    "          [\"HOTEL_ACACIAS\",-0.24986,-79.16322,3,45],\n",
    "          [\"HOTEL_MAYA\",-0.24525,-79.16612,3,21],\n",
    "          [\"HOTEL_TROJE\",-0.26004,-79.17629,2,45],\n",
    "          [\"HOTEL_PERUANA\",-0.2473,-79.15811,1,23],\n",
    "          [\"HOTEL_MOLINO\",-0.24528,-79.16534,5,25],\n",
    "          [\"HOTEL_SHALOM\",-0.24525,-79.16322,2,15],\n",
    "          [\"HOTEL_CHACARERO\",-0.24528,-79.18359,3,45],\n",
    "          [\"HOTEL_DORADO\",-0.24986,-79.15261,2,35])\n",
    "st =\"Hoteles\"\n",
    "for ll in listaL:\n",
    "    #SE INICIA EL METODO DE GENERAR NODOS LUGARES\n",
    "    print(str(ll[0]),str(ll[1]),str(ll[2]))\n",
    "    grafo.CREAR_LUGAR_KNN(\"NODO CREADO\",str(ll[0]),str(ll[1]),str(ll[2]),str(ll[3]),str(ll[4]),st)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['HOTEL_MONTECARLO', 'RESTAURANTE_QUINTA_DORADA', 'RESTAURANTE_PAOLA']\n"
     ]
    }
   ],
   "source": [
    "\n",
    "#IMPLEMENTAR EL ALGORITMO DE BUSQUEDAD POR AMPLITUD\n",
    "\n",
    "# Creamos la clase Nodo\n",
    "class Node:\n",
    "    def __init__(self, data, child=None): # Constructor de la clase\n",
    "        self.data = data\n",
    "        self.child = None\n",
    "        self.fathr = None\n",
    "        self.cost = None\n",
    "        self.set_child(child)\n",
    "\n",
    "    def set_child(self, child): # Agregar hijos\n",
    "        self.child = child\n",
    "        if self.child is not None:\n",
    "            for ch in self.child:\n",
    "                ch.fathr = self\n",
    "            \n",
    "    def equal(self, node): # Igual al equals de Java\n",
    "        if self.data == node.data:\n",
    "            return True\n",
    "        else:\n",
    "            return False\n",
    "\n",
    "    def on_list(self, node_list): # Verfiicar su el nodo esta en la lista\n",
    "        listed = False\n",
    "        for n in node_list:\n",
    "            if self.equal(n):\n",
    "                listed = True\n",
    "        return listed\n",
    "\n",
    "    def __str__(self): # Igual al toString Java\n",
    "        return str(self.data)\n",
    "    \n",
    "    \n",
    "    \n",
    "    \n",
    "    \n",
    "    \n",
    "# Implementacion del metodo de busqueda por amplitud\n",
    "def search_Amplitud_solution(connections, init_state, solution):\n",
    "    solved = False # Variable para almacenar el estado de la busqueda\n",
    "    visited_nodes = [] # Nodos visitados\n",
    "    frontrs_nodes = [] # Nodos en busqueda o lista nodos\n",
    "\n",
    "    init_node = Node(init_state) # Nodo inicial\n",
    "    frontrs_nodes.append(init_node)\n",
    "    while (not solved) and len(frontrs_nodes) != 0:\n",
    "        node = frontrs_nodes[0]\n",
    "        # extraer nodo y añadirlo a visitados\n",
    "        visited_nodes.append(frontrs_nodes.pop(0))\n",
    "        if node.data == solution: # Preguntar se el nodo obtenido es la solucion\n",
    "            solved = True\n",
    "            return node # Retornamos el nodo de la solucion\n",
    "        else:\n",
    "            # expandir nodos hijo - ciudades con conexion\n",
    "            node_data = node.data\n",
    "            child_list = []\n",
    "            for chld in connections[node_data]:\n",
    "                child = Node(chld)\n",
    "                child_list.append(child)\n",
    "                if not child.on_list(visited_nodes) and not child.on_list(frontrs_nodes):\n",
    "                    frontrs_nodes.append(child)\n",
    "            node.set_child(child_list)\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    connections = {\n",
    "        'PARQUE_CENTRAL': {'RESTAURANTE_CODELL', 'HOTEL_MONTECARLO'},\n",
    "        'HOTEL_MONTECARLO': {'RESTAURANTE_PILSENER', 'RESTAURANTE_CHURRERIA','RESTAURANTE_QUINTA_DORADA'},\n",
    "        'RESTAURANTE_QUINTA_DORADA': {'RESTAURANTE_PAOLA','RESTAURANTE_NORTENO'},\n",
    "        'RESTAURANTE_NORTENO': {'RESTAURANTE_LINA'},\n",
    "        'RESTAURANTE_CODELL': {'HOTEL_RIOBAMBA', 'HOTEL_DORADO', 'RESTAURANTE_PICHINCHA'},\n",
    "        'HOTEL_RIOBAMBA': {'RESTAURANTE_CHURRERIA', 'RESTAURANTE_LINA'},\n",
    "        'RESTAURANTE_LINA': {'RESTAURANTE_PAOLA'},\n",
    "        'RESTAURANTE_PILSENER': {'RESTAURANTE_YAGUAR', 'RESTAURANTE_QUINCHOS'},\n",
    "        'HOTEL_DORADO': {'HOTEL_ESTACION',''},\n",
    "        'HOTEL_ESTACION': {'PARQUE_CENTRAL'},\n",
    "        'RESTAURANTE_PAOLA': {'HOTEL_ESTACION'},\n",
    "        'RESTAURANTE_PICHINCHA': {'RESTAURANTE_NELLY','RESTAURANTE_CHILENO'},\n",
    "        'RESTAURANTE_NELLY': {'RESTAURANTE_DELIRIO','RESTAURANTE_TENTACIONES'},\n",
    "        'RESTAURANTE_CHILENO': {'RESTAURANTE_NELLY','HOTEL_PRIMAVERA'},\n",
    "        'HOTEL_IMPERIAL': {'RESTAURANTE_CHILENO','RESTAURANTE_TENTACIONES'},\n",
    "        'RESTAURANTE_CORBAN_COFFEE': {'RESTAURANTE_BOM','RESTAURANTE_DELIRIO'},\n",
    "        'RESTAURANTE_BOM': {'RESTAURANTE_PAOLA'},\n",
    "        'RESTAURANTE_DELIRIO': {'RESTAURANTE_PAOLA','HOTEL_DORADO'},\n",
    "        'RESTAURANTE_CHURRERIA': {'RESTAURANTE_YAGUAR','RESTAURANTE_NORTENO'},\n",
    "        'RESTAURANTE_QUINCHOS': {'RESTAURANTE_BOEMIA'},\n",
    "        'RESTAURANTE_SABOR': {'RESTAURANTE_BOEMIA','RESTAURANTE_PILSENER'},\n",
    "        'RESTAURANTE_BOEMIA': {'RESTAURANTE_ANDESBULL','RESTAURANTE_XIMENITA'},\n",
    "        'RESTAURANTE_ANDESBULL': {'RESTAURANTE_XIMENITA'},\n",
    "        'RESTAURANTE_XIMENITA': {'RESTAURANTE_ROSITA'},\n",
    "        'RESTAURANTE_ROSITA': {'RESTAURANTE_SABOR','RESTAURANTE_COFFEREX'},\n",
    "        'HOTEL_SOL': {'RESTAURANTE_CODELL','HOTEL_ROCIO'},\n",
    "        'RESTAURANTE_COFFEREX': {'HOTEL_HUASI','HOTEL_SOL'},\n",
    "        'HOTEL_ROCIO': {'RESTAURANTE_CODELL'},\n",
    "        'HOTEL_HUASI': {'HOTEL_ROCIO','RESTAURANTE_JEKE'},\n",
    "        'HOTEL_PRIMAVERA': {'RESTAURANTE_JEKE','HOTEL_ROCIO'},        \n",
    "        'RESTAURANTE_YAGUAR': {'RESTAURANTE_QUINCHOS'},\n",
    "        'RESTAURANTE_JEKE': {'HOTEL_IMPERIAL'}    \n",
    "    }\n",
    "\n",
    "    init_state = 'HOTEL_MONTECARLO'\n",
    "    solution = 'RESTAURANTE_PAOLA'\n",
    "    solution_node = search_Amplitud_solution(connections, init_state, solution)\n",
    "    # mostrar resultado\n",
    "    result = []\n",
    "    node = solution_node\n",
    "    if node is not None: \n",
    "        while node.fathr is not None:\n",
    "            result.append(node.data)\n",
    "            node = node.fathr\n",
    "        result.append(init_state)\n",
    "        result.reverse() # Reverso el resultado (Solo para presentar)\n",
    "        print(result)\n",
    "    else:\n",
    "        print(\"No hay solucion !!!!\")\n",
    "    \n",
    "#SE CREA EL GRAFO CON LAS RUTAS COMO LAS RELACIONES\n",
    "#CALL gds.graph.create('migrafo', 'Lugares', 'RUTA_DE', { relationshipProperties: 'costo' })\n",
    "\n",
    "# MATCH (HOTEL_MONTECARLO:Lugares{nombre:'HOTEL_MONTECARLO'}), (RESTAURANTE_PAOLA:Lugares{nombre:'RESTAURANTE_PAOLA'})\n",
    "#  WITH id(HOTEL_MONTECARLO) AS startNode, [id(RESTAURANTE_PAOLA)] AS targetNodes\n",
    "# CALL gds.alpha.bfs.stream('migrafo', {startNode: startNode, targetNodes: targetNodes})\n",
    "#  YIELD path UNWIND [ n in nodes(path) | n.nombre ] AS tags  RETURN tags\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[[4, 2, 3, 1], [2, 4, 3, 1], [2, 3, 4, 1], [3, 2, 4, 1], [3, 4, 2, 1], [4, 3, 2, 1], [4, 3, 1, 2], [3, 4, 1, 2], [3, 1, 4, 2], [1, 3, 4, 2], [1, 4, 3, 2], [4, 1, 3, 2], [4, 1, 2, 3], [1, 4, 2, 3], [1, 2, 4, 3], [2, 1, 4, 3], [2, 1, 3, 4], [1, 2, 3, 4]]\n"
     ]
    }
   ],
   "source": [
    "#SE IMPLEMENTE ALGORITMO BUSQUEDAD POR PROFUNDIDA\n",
    "# Busqueda en Profundidad\n",
    "\n",
    "# Creamos la clase Nodo\n",
    "class Node:\n",
    "    def __init__(self, data, child=None): # Constructor de la clase\n",
    "        self.data = data\n",
    "        self.child = None\n",
    "        self.fathr = None\n",
    "        self.cost = None\n",
    "        self.set_child(child)\n",
    "\n",
    "    def set_child(self, child): # Agregar hijos\n",
    "        self.child = child\n",
    "        if self.child is not None:\n",
    "            for ch in self.child:\n",
    "                ch.fathr = self\n",
    "            \n",
    "    def equal(self, node): # Igual al equals de Java\n",
    "        if self.data == node.data:\n",
    "            return True       \n",
    "        \n",
    "        else:\n",
    "            return False\n",
    "\n",
    "    def on_list(self, node_list): # Verfiicar su el nodo esta en la lista\n",
    "        listed = False\n",
    "        for n in node_list:\n",
    "            if self.equal(n):\n",
    "                listed = True\n",
    "        return listed\n",
    "\n",
    "    def __str__(self): # Igual al toString Java\n",
    "        return str(self.data)\n",
    "    \n",
    "# Implementacion del metodo de busqueda por profundidad\n",
    "def search_profundidad(init_node, solution, visited):\n",
    "    visited.append(init_node.data) #Lista de visitados\n",
    "    if init_node.data == solution: # Condicion de salida recursividad (Encontro la solucion)\n",
    "        return init_node # Retorno el nodo resultado\n",
    "    else:\n",
    "        # Expandir nodos sucesores (hijos)\n",
    "        node_data = init_node.data\n",
    "        son = [node_data[1], node_data[0], node_data[2], node_data[3]]\n",
    "        izq = Node(son)\n",
    "        son = [node_data[0], node_data[2], node_data[1], node_data[3]]\n",
    "        centro = Node(son)\n",
    "        son = [node_data[0], node_data[1], node_data[3], node_data[2]]\n",
    "        der = Node(son)\n",
    "        init_node.set_child([izq, centro, der])\n",
    "\n",
    "        for node_son in init_node.child: # Recorrer los nodos hijos\n",
    "            if not node_son.data in visited: # No deben estar en los nodos visitados\n",
    "                # Llamada Recursiva\n",
    "                Solution = search_profundidad(node_son, solution, visited) \n",
    "                if Solution is not None: # Cuando encuentra una solucion\n",
    "                    return Solution # Retornamos la solucion encontrada\n",
    "        return None\n",
    "\n",
    "init_state = [4, 2, 3, 1] # Creamos un estado inicial\n",
    "solution = [1, 2, 3, 4] # La solucion que debe buscar\n",
    "#Inicializamos las variables\n",
    "solution_node = None \n",
    "visited = []\n",
    "init_node = Node(init_state)\n",
    "node = search_profundidad(init_node, solution, visited) # Llamamos la metodo de busqueda\n",
    "\n",
    "# Mostrar Resultado\n",
    "result = []\n",
    "while node.fathr is not None:\n",
    "    result.append(node.data)\n",
    "    node = node.fathr\n",
    "result.append(init_state)\n",
    "result.reverse() # Reverso el resultado (Solo para presentar)\n",
    "print(result)\n",
    "\n",
    "\n",
    "#\n",
    "# CALL gds.graph.create('myGraph', 'Lugares', 'RUTA_DE', { relationshipProperties: 'costo' })\n",
    "\n",
    "# ALGORITMO DE BUSQUEDA POR PROFUNDIDAD\n",
    "# MATCH (HOTEL_MONTECARLO:Lugares{nombre:'HOTEL_MONTECARLO'}), (RESTAURANTE_PAOLA:Lugares{nombre:'RESTAURANTE_PAOLA'})\n",
    "# WITH id(HOTEL_MONTECARLO) AS startNode, [id(RESTAURANTE_PAOLA)] AS targetNodes\n",
    "# CALL gds.alpha.dfs.stream('myGraph', {startNode: startNode, targetNodes: targetNodes})\n",
    "# YIELD path\n",
    "# UNWIND [ n in nodes(path) | n.nombre ] AS tags\n",
    "# RETURN tags\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#SE IMPLEMENTE ALGORITMO BUSQUEDAD POR COSTO DE A*\n",
    "# ALGORITMO DE BUSQUEDA A*\n",
    "# MATCH (start:Lugares {nombre:\n",
    "# 'HOTEL_MONTECARLO'}), (end:Lugares {nombre: 'RESTAURANTE_PAOLA'})\n",
    "# CALL gds.alpha.shortestPath.astar.stream({\n",
    "#   nodeProjection: {\n",
    "#     Lugares: {\n",
    "#       properties: ['longitud', 'latitud']\n",
    "#     }\n",
    "#   },\n",
    "#   relationshipProjection: {\n",
    "#     CONNECTION: {\n",
    "#       type: 'RUTA_DE',\n",
    "#       orientation: 'UNDIRECTED',\n",
    "#       properties: 'costo'\n",
    "#     }\n",
    "#   },\n",
    "#   startNode: start,\n",
    "#   endNode: end,\n",
    "#   propertyKeyLat: 'latitud',\n",
    "#   propertyKeyLon: 'longitud'\n",
    "# })\n",
    "# YIELD nodeId, cost\n",
    "# RETURN gds.util.asNode(nodeId).nombre AS lugares, cost\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
